nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128,True]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f, [512,True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f,  [1024,True]]
  - [-1, 1, MAC3T, [1024, 5]] # 9

# YOLOv8.0n head
head:
  - [[-1,6], 1, CGAupsample, [1024]]
  - [ [ -1, 6 ], 1,Concat,[ 1 ]]
  - [-1, 3,C2f, [512,True]] # 13

  - [[-1,4], 1, CGAupsample, [512]]
  - [ [ -1, 4 ], 1, Concat, [ 1 ] ]
  - [-1, 3,C2f, [256,True]] # 16

  - [ [ -1,2 ], 1, CGAupsample, [256] ]
  - [ [ -1, 2 ], 1, Concat, [ 1 ] ]
  - [-1, 3, C2f, [128,True]] # 19

  - [[9,12], 1, CGAupsample, [1024]]
  - [ [ -1, 12], 1, Concat, [ 1 ] ]
  - [-1, 3, C2f, [512,True]] # 22 16-large

  - [[-1,15], 1, CGAupsample, [512]]
  - [ [ -1,15], 1, Concat, [ 1 ] ] # cat backbone P3
  - [-1, 3, C2f, [256,True]] # 25 8-medium

  - [ [ -1,18 ], 1, CGAupsample, [ 256] ]
  - [ [ -1,18], 1, Concat, [ 1 ] ] # cat backbone P3
  - [-1, 3, C2f, [128,True]] # 28 4-large

  - [ [ 21,24,27], 1, Detect, [ nc ] ]