nc: 80
scales:
   n: [0.33, 0.25, 1024]
backbone:
 # [from, repeats, module, args]
 - [-1, 1, Conv, [64, 3, 2]]
 - [-1, 1, Conv, [128, 3, 2]]
 - [-1, 3, ResIR2C, [128,3,True]]
 - [-1, 1, Conv, [256, 3, 2]]
 - [-1, 6, ResIR2C, [256,3, True]]
 - [-1, 1, Conv, [512, 3, 2]]
 - [-1, 6, ResIR2C, [512,3,True]]
 - [-1, 1, Conv, [1024, 3, 2]]
 - [-1, 3, ResIR2C,  [1024,3,True]]
 - [[2,4,6,8], 1, MAC3T,  [1024]]
head:
 - [-1, 1, ResIR2C, [256,3,True]]

 - [[9,6], 1, CGAupsample, [1024]]
 - [ [ -1, 6 ], 1,Concat,[ 1 ]]
 - [-1,3,ResIR2C, [256,3,True]]

 - [[-1,4], 1, CGAupsample, [256]]
 - [ [ -1, 4 ], 1, Concat, [ 1 ] ]
 - [-1, 3,ResIR2C, [256,3,True]]

 - [ [ -1,2 ], 1, CGAupsample, [256]]
 - [ [ -1, 2 ], 1, Concat, [ 1 ] ]
 - [-1, 3, ResIR2C, [256,3,True]]

 - [[9,13], 1, CGAupsample, [1024]]
 - [ [ -1, 13,6], 1, Concat, [1]]
 - [-1, 3, ResIR2C, [256,3,True]]

 - [[-1,16], 1, CGAupsample, [256]]
 - [ [ -1,16,4], 1, Concat, [ 1 ] ]
 - [-1, 3, ResIR2C, [256,3,True]]

 - [ [ -1,19 ], 1, CGAupsample, [256] ]
 - [ [ -1,19,2], 1, Concat, [ 1 ] ]
 - [-1, 3, ResIR2C, [256,3,True]]

 - [ [10,22,25,28], 1, Detect, [ nc ] ]

